# Clear Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPBuildingConstructionSet..::..Clear Method
MEPBuildingConstructionSet Class See Also
---
Removes every MEPBuildingConstruction from the set, rendering it empty.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Clear()
```

Visual Basic
---
```text
Public Overridable Sub Clear
```

Visual C++
---
```text
public:
virtual void Clear()
```

# See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace